<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/2e7857a9-979b-499d-b894-69aaa1032c39/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 61 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore_docdb.aws_docdb_cluster.docdb_primary will be updated in-place
  ~ resource "aws_docdb_cluster" "docdb_primary" {
      ~ deletion_protection             = false -> true
        id                              = "staging-keyserver-keystore-docdb-primary-cluster"
        tags                            = {}
      ~ vpc_security_group_ids          = [
          - "sg-01de29cd9149d5d29",
        ] -> (known after apply)
        # (23 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place
  ~ resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "staging-keyserver-keystore-docdb-private-subnet-group"
        name        = "staging-keyserver-keystore-docdb-private-subnet-group"
      ~ subnet_ids  = [
          - "subnet-0851c91f1a82ece18",
          - "subnet-0f59998ee3eeb6b29",
          - "subnet-0fe665bde6c07d332",
          + "subnet-006f9fc131af3565e",
          + "subnet-05894f2d41c0e8b45",
          + "subnet-06557bf48886434f1",
        ]
        tags        = {}
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_security_group.service_security_group must be replaced
-/+ resource "aws_security_group" "service_security_group" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow outbound traffic from the DocDB cluster"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-01de29cd9149d5d29" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow inbound traffic to the DocDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "staging-keyserver-keystore-docdb-service"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-08d4ffa8940e11aa5" -> "vpc-09dce0b23af575478" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main will be destroyed
  # (because aws_cloudwatch_log_group.main is not in configuration)
  - resource "aws_cloudwatch_log_group" "main" {
      - arn               = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - id                = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - name              = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null
      - retention_in_days = 7 -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.main is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "main" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",
        ] -> null
      - alarm_name                = "staging-keyserver-docdb-autoscaling-0" -> null
      - arn                       = "arn:aws:cloudwatch:eu-central-1:898587786287:alarm:staging-keyserver-docdb-autoscaling-0" -> null
      - comparison_operator       = "GreaterThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "DBClusterIdentifier" = "staging-keyserver-keystore-docdb-primary-cluster"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "staging-keyserver-docdb-autoscaling-0" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "CPUUtilization" -> null
      - namespace                 = "AWS/DocDB" -> null
      - ok_actions                = [
          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - threshold                 = 80 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_policy.lambda will be destroyed
  # (because aws_iam_policy.lambda is not in configuration)
  - resource "aws_iam_policy" "lambda" {
      - arn       = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - id        = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - name      = "staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*:*"
                    },
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds:DescribeDBClusters",
                          - "rds:CreateDBInstance",
                          - "rds:DeleteDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:rds:eu-central-1:898587786287:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA5COABPQXW45SOGJUG" -> null
      - tags      = {} -> null
      - tags_all  = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-08-07T15:13:40Z" -> null
      - force_detach_policies = false -> null
      - id                    = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - unique_id             = "AROA5COABPQXZV7K3BXPB" -> null

      - inline_policy {}
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda will be destroyed
  # (because aws_iam_role_policy_attachment.lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda" {
      - id         = "staging-keyserver-docdb-autoscaling-eu-central-1-role-20230807151343820300000001" -> null
      - policy_arn = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null
      - role       = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be destroyed
  # (because aws_lambda_function.main is not in configuration)
  - resource "aws_lambda_function" "main" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - filename                       = ".terraform/modules/keystore_docdb.docdb-autoscaling/.files/init.zip" -> null
      - function_name                  = "staging-keyserver-docdb-autoscaling" -> null
      - handler                        = "index.handler" -> null
      - id                             = "staging-keyserver-docdb-autoscaling" -> null
      - invoke_arn                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling/invocations" -> null
      - last_modified                  = "2023-08-07T15:20:15.243+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "iG52XIKJxJppt5z7sJPoMUh/OAaeKIZP/W0R0T4h3vQ=" -> null
      - source_code_size               = 1933 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "cluster_identifier" = "staging-keyserver-keystore-docdb-primary-cluster"
              - "max_capacity"       = "6"
              - "min_capacity"       = "0"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_permission.sns will be destroyed
  # (because aws_lambda_permission.sns is not in configuration)
  - resource "aws_lambda_permission" "sns" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - id            = "AllowSubscriptionToSNS" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - statement_id  = "AllowSubscriptionToSNS" -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic.main will be destroyed
  # (because aws_sns_topic.main is not in configuration)
  - resource "aws_sns_topic" "main" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "staging-keyserver-docdb-autoscaling" -> null
      - owner                                    = "898587786287" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "898587786287"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {
          - "Application"      = "keyserver"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "Name"             = "keyserver"
          - "ProvisionedBy"    = "Terraform"
        } -> null
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main will be destroyed
  # (because aws_sns_topic_subscription.main is not in configuration)
  - resource "aws_sns_topic_subscription" "main" {
      - arn                             = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null
      - owner_id                        = "898587786287" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "lambda" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null
    }

Plan: 2 to add, 4 to change, 11 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"%0A        name                               = "staging_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 61 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster.docdb_primary will be updated in-place%0A  ~ resource "aws_docdb_cluster" "docdb_primary" {%0A      ~ deletion_protection             = false -> true%0A        id                              = "staging-keyserver-keystore-docdb-primary-cluster"%0A        tags                            = {}%0A      ~ vpc_security_group_ids          = [%0A          - "sg-01de29cd9149d5d29",%0A        ] -> (known after apply)%0A        # (23 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place%0A  ~ resource "aws_docdb_subnet_group" "private_subnets" {%0A        id          = "staging-keyserver-keystore-docdb-private-subnet-group"%0A        name        = "staging-keyserver-keystore-docdb-private-subnet-group"%0A      ~ subnet_ids  = [%0A          - "subnet-0851c91f1a82ece18",%0A          - "subnet-0f59998ee3eeb6b29",%0A          - "subnet-0fe665bde6c07d332",%0A          + "subnet-006f9fc131af3565e",%0A          + "subnet-05894f2d41c0e8b45",%0A          + "subnet-06557bf48886434f1",%0A        ]%0A        tags        = {}%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_security_group.service_security_group must be replaced%0A-/+ resource "aws_security_group" "service_security_group" {%0A      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> (known after apply)%0A      ~ egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/16",%0A                ]%0A              - description      = "Allow outbound traffic from the DocDB cluster"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.192.0.0/16",%0A                ]%0A              + description      = "Allow outbound traffic from the DocDB cluster"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      ~ id                     = "sg-01de29cd9149d5d29" -> (known after apply)%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/16",%0A                ]%0A              - description      = "Allow inbound traffic to the DocDB cluster"%0A              - from_port        = 27017%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 27017%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.192.0.0/16",%0A                ]%0A              + description      = "Allow inbound traffic to the DocDB cluster"%0A              + from_port        = 27017%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 27017%0A            },%0A        ]%0A        name                   = "staging-keyserver-keystore-docdb-service"%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "898587786287" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ vpc_id                 = "vpc-08d4ffa8940e11aa5" -> "vpc-09dce0b23af575478" # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_log_group.main will be destroyed%0A  # (because aws_cloudwatch_log_group.main is not in configuration)%0A  - resource "aws_cloudwatch_log_group" "main" {%0A      - arn               = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling" -> null%0A      - id                = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null%0A      - name              = "/aws/lambda/staging-keyserver-docdb-autoscaling" -> null%0A      - retention_in_days = 7 -> null%0A      - tags              = {} -> null%0A      - tags_all          = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] will be destroyed%0A  # (because aws_cloudwatch_metric_alarm.main is not in configuration)%0A  - resource "aws_cloudwatch_metric_alarm" "main" {%0A      - actions_enabled           = true -> null%0A      - alarm_actions             = [%0A          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",%0A        ] -> null%0A      - alarm_name                = "staging-keyserver-docdb-autoscaling-0" -> null%0A      - arn                       = "arn:aws:cloudwatch:eu-central-1:898587786287:alarm:staging-keyserver-docdb-autoscaling-0" -> null%0A      - comparison_operator       = "GreaterThanThreshold" -> null%0A      - datapoints_to_alarm       = 0 -> null%0A      - dimensions                = {%0A          - "DBClusterIdentifier" = "staging-keyserver-keystore-docdb-primary-cluster"%0A        } -> null%0A      - evaluation_periods        = 1 -> null%0A      - id                        = "staging-keyserver-docdb-autoscaling-0" -> null%0A      - insufficient_data_actions = [] -> null%0A      - metric_name               = "CPUUtilization" -> null%0A      - namespace                 = "AWS/DocDB" -> null%0A      - ok_actions                = [%0A          - "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling",%0A        ] -> null%0A      - period                    = 300 -> null%0A      - statistic                 = "Average" -> null%0A      - tags                      = {} -> null%0A      - tags_all                  = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - threshold                 = 80 -> null%0A      - treat_missing_data        = "missing" -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_policy.lambda will be destroyed%0A  # (because aws_iam_policy.lambda is not in configuration)%0A  - resource "aws_iam_policy" "lambda" {%0A      - arn       = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null%0A      - id        = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null%0A      - name      = "staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null%0A      - path      = "/" -> null%0A      - policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "logs:CreateLogStream",%0A                          - "logs:CreateLogGroup",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*"%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "logs:PutLogEvents",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "arn:aws:logs:eu-central-1:898587786287:log-group:/aws/lambda/staging-keyserver-docdb-autoscaling:*:*"%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "rds:DescribeDBInstances",%0A                          - "rds:DescribeDBClusters",%0A                          - "rds:CreateDBInstance",%0A                          - "rds:DeleteDBInstance",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:rds:eu-central-1:898587786287:*",%0A                        ]%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id = "ANPA5COABPQXW45SOGJUG" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role.lambda will be destroyed%0A  # (because aws_iam_role.lambda is not in configuration)%0A  - resource "aws_iam_role" "lambda" {%0A      - arn                   = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null%0A      - assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "lambda.amazonaws.com"%0A                        }%0A                      - Sid       = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - create_date           = "2023-08-07T15:13:40Z" -> null%0A      - force_detach_policies = false -> null%0A      - id                    = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null%0A      - managed_policy_arns   = [%0A          - "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy",%0A        ] -> null%0A      - max_session_duration  = 3600 -> null%0A      - name                  = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null%0A      - path                  = "/" -> null%0A      - tags                  = {} -> null%0A      - tags_all              = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - unique_id             = "AROA5COABPQXZV7K3BXPB" -> null%0A%0A      - inline_policy {}%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_iam_role_policy_attachment.lambda will be destroyed%0A  # (because aws_iam_role_policy_attachment.lambda is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "lambda" {%0A      - id         = "staging-keyserver-docdb-autoscaling-eu-central-1-role-20230807151343820300000001" -> null%0A      - policy_arn = "arn:aws:iam::898587786287:policy/staging-keyserver-docdb-autoscaling-eu-central-1-policy" -> null%0A      - role       = "staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be destroyed%0A  # (because aws_lambda_function.main is not in configuration)%0A  - resource "aws_lambda_function" "main" {%0A      - architectures                  = [%0A          - "x86_64",%0A        ] -> null%0A      - arn                            = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null%0A      - filename                       = ".terraform/modules/keystore_docdb.docdb-autoscaling/.files/init.zip" -> null%0A      - function_name                  = "staging-keyserver-docdb-autoscaling" -> null%0A      - handler                        = "index.handler" -> null%0A      - id                             = "staging-keyserver-docdb-autoscaling" -> null%0A      - invoke_arn                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling/invocations" -> null%0A      - last_modified                  = "2023-08-07T15:20:15.243+0000" -> null%0A      - layers                         = [] -> null%0A      - memory_size                    = 128 -> null%0A      - package_type                   = "Zip" -> null%0A      - publish                        = false -> null%0A      - qualified_arn                  = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling:$LATEST" -> null%0A      - reserved_concurrent_executions = -1 -> null%0A      - role                           = "arn:aws:iam::898587786287:role/staging-keyserver-docdb-autoscaling-eu-central-1-role" -> null%0A      - runtime                        = "python3.9" -> null%0A      - source_code_hash               = "iG52XIKJxJppt5z7sJPoMUh/OAaeKIZP/W0R0T4h3vQ=" -> null%0A      - source_code_size               = 1933 -> null%0A      - tags                           = {} -> null%0A      - tags_all                       = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A      - timeout                        = 3 -> null%0A      - version                        = "$LATEST" -> null%0A%0A      - environment {%0A          - variables = {%0A              - "cluster_identifier" = "staging-keyserver-keystore-docdb-primary-cluster"%0A              - "max_capacity"       = "6"%0A              - "min_capacity"       = "0"%0A            } -> null%0A        }%0A%0A      - tracing_config {%0A          - mode = "PassThrough" -> null%0A        }%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_permission.sns will be destroyed%0A  # (because aws_lambda_permission.sns is not in configuration)%0A  - resource "aws_lambda_permission" "sns" {%0A      - action        = "lambda:InvokeFunction" -> null%0A      - function_name = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null%0A      - id            = "AllowSubscriptionToSNS" -> null%0A      - principal     = "sns.amazonaws.com" -> null%0A      - source_arn    = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null%0A      - statement_id  = "AllowSubscriptionToSNS" -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic.main will be destroyed%0A  # (because aws_sns_topic.main is not in configuration)%0A  - resource "aws_sns_topic" "main" {%0A      - application_success_feedback_sample_rate = 0 -> null%0A      - arn                                      = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null%0A      - content_based_deduplication              = false -> null%0A      - fifo_topic                               = false -> null%0A      - firehose_success_feedback_sample_rate    = 0 -> null%0A      - http_success_feedback_sample_rate        = 0 -> null%0A      - id                                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null%0A      - lambda_success_feedback_sample_rate      = 0 -> null%0A      - name                                     = "staging-keyserver-docdb-autoscaling" -> null%0A      - owner                                    = "898587786287" -> null%0A      - policy                                   = jsonencode(%0A            {%0A              - Id        = "__default_policy_ID"%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "SNS:GetTopicAttributes",%0A                          - "SNS:SetTopicAttributes",%0A                          - "SNS:AddPermission",%0A                          - "SNS:RemovePermission",%0A                          - "SNS:DeleteTopic",%0A                          - "SNS:Subscribe",%0A                          - "SNS:ListSubscriptionsByTopic",%0A                          - "SNS:Publish",%0A                        ]%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "AWS:SourceOwner" = "898587786287"%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "*"%0A                        }%0A                      - Resource  = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling"%0A                      - Sid       = "__default_statement_ID"%0A                    },%0A                ]%0A              - Version   = "2008-10-17"%0A            }%0A        ) -> null%0A      - sqs_success_feedback_sample_rate         = 0 -> null%0A      - tags                                     = {} -> null%0A      - tags_all                                 = {%0A          - "Application"      = "keyserver"%0A          - "Env"              = "staging"%0A          - "EnvironmentGroup" = "walletconnect"%0A          - "Name"             = "keyserver"%0A          - "ProvisionedBy"    = "Terraform"%0A        } -> null%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_sns_topic_subscription.main will be destroyed%0A  # (because aws_sns_topic_subscription.main is not in configuration)%0A  - resource "aws_sns_topic_subscription" "main" {%0A      - arn                             = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null%0A      - confirmation_timeout_in_minutes = 1 -> null%0A      - confirmation_was_authenticated  = true -> null%0A      - endpoint                        = "arn:aws:lambda:eu-central-1:898587786287:function:staging-keyserver-docdb-autoscaling" -> null%0A      - endpoint_auto_confirms          = false -> null%0A      - id                              = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling:3f833700-eec4-4009-9d92-4f94f78d53c8" -> null%0A      - owner_id                        = "898587786287" -> null%0A      - pending_confirmation            = false -> null%0A      - protocol                        = "lambda" -> null%0A      - raw_message_delivery            = false -> null%0A      - topic_arn                       = "arn:aws:sns:eu-central-1:898587786287:staging-keyserver-docdb-autoscaling" -> null%0A    }%0A%0APlan: 2 to add, 4 to change, 11 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*